namespace Ex2
{
    internal class Program
    {
        static void Main(string[] args)
        {
            MusicalInstrument cello = new Cello("віолончель",
                "Віолончель з’явилася в Європі у XVI столітті та стала одним із головних інструментів симфонічного оркестру",
                "Віолончель — це великий струнний інструмент, що належить до сімейства скрипок. Її часто використовують у класичній музиці, а також у сучасних жанрах.");
            cello.Desk();
            cello.Show();
            cello.Sound();
            cello.History();

            Trombone trombone = new Trombone("тромбон",
                "Перші тромбони з’явилися у XV столітті, і відтоді вони стали незамінною частиною багатьох музичних жанрів",
                "Тромбон — це інструмент із рухомим слайдом, який змінює висоту звуку. Його використовують у джазі, оркестровій та естрадній музиці");
            trombone.Show();
            trombone.Sound();
                
        }
    }
}
